tube0013/esphome-components/components/efr32_info/efr32_info.cpp
#include "esphome/components/efr32_info/efr32_info.h"

#include "esphome/components/efr32_info/ash_util.h"
#include "esphome/core/application.h"
#include "esphome/core/log.h"

#include <algorithm>
#include <cctype>
#include <cstdio>
#include <initializer_list>
#include <vector>

namespace esphome {
namespace efr32_info {

namespace {
const char *const TAG = "efr32_info";

std::string trim_token_ascii(const std::vector<uint8_t> &bytes) {
  std::string out;
  out.reserve(bytes.size());
  for (uint8_t b : bytes) {
    if (b == 0x00 || b == 0xFF)
      break;
    if (b >= 0x20 && b <= 0x7E)
      out.push_back(static_cast<char>(b));
  }
  return out;
}

std::string find_printable_run(const std::vector<uint8_t> &bytes) {
  std::string best;
  std::string current;
  for (uint8_t b : bytes) {
    if (b >= 0x20 && b <= 0x7E) {
      current.push_back(static_cast<char>(b));
    } else {
      if (current.size() > best.size())
        best = current;
      current.clear();
    }
  }
  if (current.size() > best.size())
    best = current;
  return best;
}

std::string network_status_to_string(uint8_t status) {
  switch (status) {
    case 0x00:
      return "no_network";
    case 0x01:
      return "joining";
    case 0x02:
      return "joined";
    case 0x03:
      return "joined_no_parent";
    case 0x04:
      return "leaving";
    default: {
      char buf[16];
      std::snprintf(buf, sizeof(buf), "0x%02X", static_cast<unsigned>(status));
      return buf;
    }
  }
}

}  // namespace

static inline uint8_t ctrl_ack(uint8_t ctrl) {
  return static_cast<uint8_t>(ctrl & 0x07);
}

void EFR32InfoComponent::loop() {
  if (!want_probe_)
    return;

  want_probe_ = false;
  run_probe_();
}

void EFR32InfoComponent::set_busy_(bool on) {
  if (busy_sensor_ != nullptr && busy_state_ != on) {
    busy_sensor_->publish_state(on);
    busy_state_ = on;
  }
}

void EFR32InfoComponent::publish_text_(esphome::text_sensor::TextSensor *sensor, const std::string &value) {
  if (sensor == nullptr)
    return;
  sensor->publish_state(value);
}

void EFR32InfoComponent::update_status_text_(const std::string &value) {
  if (last_status_ == value)
    return;
  last_status_ = value;
  publish_text_(status_sensor_, last_status_);
}

void EFR32InfoComponent::delay_(uint32_t ms) {
  uint32_t start = millis();
  while (millis() - start < ms) {
    App.feed_wdt();
    esphome::delay(1);
  }
}

void EFR32InfoComponent::flush_uart_() {
  if (uart_ == nullptr)
    return;
  uint8_t b;
  uint32_t discarded = 0;
  std::vector<uint8_t> sample;
  sample.reserve(32);
  for (int i = 0; i < 96; i++) {
    bool any = false;
    while (uart_->available()) {
      if (uart_->read_byte(&b)) {
        if (sample.size() < 32)
          sample.push_back(b);
        discarded++;
      }
      any = true;
      App.feed_wdt();
    }
    if (!any)
      break;
    delay_(2);
  }
  if (discarded > 0) {
    ESP_LOGV(TAG, "flush_uart_ discarded %u bytes sample=%s", static_cast<unsigned>(discarded),
             bytes_to_hex_(sample, 64).c_str());
  }
}

bool EFR32InfoComponent::recv_any_frame_(efr32::ash::Frame &frame, uint32_t timeout_ms) {
  if (efr32::ash::recv_frame(ash_state_, frame, timeout_ms))
    return true;

  efr32::ash::Frame loose_frame;
  if (!efr32::ash::recv_frame_loose(ash_state_, loose_frame, timeout_ms))
    return false;

  frame = loose_frame;
  ESP_LOGW(TAG, "Loose frame parsed ctrl=0x%02X len=%zu", static_cast<unsigned>(frame.control),
           frame.payload.size());
  return true;
}

bool EFR32InfoComponent::wait_for_initial_data_(uint32_t timeout_ms) {
  uint32_t deadline = millis() + timeout_ms;
  bool saw_any = false;
  bool saw_data = false;
  uint32_t last_data_ms = millis();
  while (millis() < deadline) {
    efr32::ash::Frame frame;
    if (!recv_any_frame_(frame, 80)) {
      if (!efr32::ash::recv_frame_loose(ash_state_, frame, 80)) {
        if (saw_data && millis() - last_data_ms > 40)
          return true;
        delay_(5);
        continue;
      }
      ESP_LOGV(TAG, "Loose frame ctrl=0x%02X type=%d while waiting for data",
               static_cast<unsigned>(frame.control), static_cast<int>(frame.type));
    }

    if (frame.type == efr32::ash::FrameType::DATA) {
      if (raw_capture_) {
        ESP_LOGV(TAG, "RAW RX ctrl=0x%02X len=%u data=%s", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(frame.payload.size()), bytes_to_hex_(frame.payload, 80).c_str());
      }
      ESP_LOGV(TAG, "wait_initial DATA ctrl=0x%02X len=%zu", static_cast<unsigned>(frame.control),
               frame.payload.size());
      ESP_LOGV(TAG, "wait_initial DATA ctrl=0x%02X len=%zu host_rx_seq_=%u",
               static_cast<unsigned>(frame.control), frame.payload.size(),
               static_cast<unsigned>(host_rx_seq_));
      bool accepted = ack_data_frame_(frame.control, frame.payload);
      saw_any = true;
      if (accepted)
        saw_data = true;
      if (accepted && (ash_state_.next_ack & 0x07) == 4)
        return true;
      last_data_ms = millis();
      continue;
    }
    if (frame.type == efr32::ash::FrameType::RESET) {
      apply_rstack_from_payload_(frame.payload);
      saw_any = true;
      last_data_ms = millis();
      continue;
    }
  }
  ESP_LOGW(TAG, "wait_for_initial_data_ timeout saw_data=%d host_rx_seq_=%u next_ack=%u",
           saw_data ? 1 : 0, static_cast<unsigned>(host_rx_seq_),
           static_cast<unsigned>(ash_state_.next_ack & 0x07));
  return saw_data;
}

void EFR32InfoComponent::drain_frames_(uint32_t idle_timeout_ms, int target_ack) {
  uint32_t idle_start = millis();
  while (millis() - idle_start < idle_timeout_ms) {
    efr32::ash::Frame frame;
    if (!recv_any_frame_(frame, 40)) {
      App.feed_wdt();
      delay_(5);
      continue;
    }

    idle_start = millis();
    switch (frame.type) {
      case efr32::ash::FrameType::DATA: {
        bool accepted = ack_data_frame_(frame.control, frame.payload);
        ESP_LOGV(TAG, "drain DATA ctrl=0x%02X accepted=%s host_rx_seq_=%u",
                 static_cast<unsigned>(frame.control), accepted ? "true" : "false",
                 static_cast<unsigned>(host_rx_seq_));
        if (accepted && target_ack >= 0 && host_rx_seq_ == target_ack) {
          ESP_LOGI(TAG, "drain_frames_ reached target ack=%d host_rx_seq_=%u",
                   target_ack, static_cast<unsigned>(host_rx_seq_));
          return;
        }
        break;
      }
      case efr32::ash::FrameType::ACK: {
        uint8_t ack = static_cast<uint8_t>(frame.control & 0x07);
        ESP_LOGV(TAG, "drain ACK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        break;
      }
      case efr32::ash::FrameType::NAK: {
        uint8_t ack = static_cast<uint8_t>(frame.control & 0x07);
        ESP_LOGV(TAG, "drain NAK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        break;
      }
      case efr32::ash::FrameType::ERROR:
        ESP_LOGW(TAG, "Drain saw ASH error 0x%04X", frame.payload.size() >= 2
                                                   ? static_cast<unsigned>(frame.payload[0] << 8 | frame.payload[1])
                                                   : 0U);
        break;
      case efr32::ash::FrameType::RESET:
        apply_rstack_from_payload_(frame.payload);
        break;
      default:
        break;
    }
  }
  ESP_LOGV(TAG, "drain_frames_ exit idle_timeout=%u host_rx_seq_=%u next_ack=%u",
           static_cast<unsigned>(idle_timeout_ms), static_cast<unsigned>(host_rx_seq_),
           static_cast<unsigned>(ash_state_.next_ack & 0x07));
}

bool EFR32InfoComponent::prime_link_(uint32_t timeout_ms) {
  uint32_t deadline = millis() + timeout_ms;
  while (millis() < deadline) {
    efr32::ash::Frame frame;
    if (!recv_any_frame_(frame, 40)) {
      App.feed_wdt();
      delay_(5);
      continue;
    }

    switch (frame.type) {
      case efr32::ash::FrameType::RESET: {
        apply_rstack_from_payload_(frame.payload);
        break;
      }
      case efr32::ash::FrameType::DATA: {
        ESP_LOGV(TAG, "prime DATA ctrl=0x%02X len=%zu", static_cast<unsigned>(frame.control),
                 frame.payload.size());
        bool accepted = ack_data_frame_(frame.control, frame.payload);
        ESP_LOGV(TAG, "prime DATA ctrl=0x%02X accepted=%s host_rx_seq_=%u",
                 static_cast<unsigned>(frame.control), accepted ? "true" : "false",
                 static_cast<unsigned>(host_rx_seq_));
        if (host_rx_seq_ >= 4)
          return true;
        break;
      }
      case efr32::ash::FrameType::ACK: {
        uint8_t ack = static_cast<uint8_t>(frame.control & 0x07);
        ESP_LOGV(TAG, "prime ACK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        break;
      }
      case efr32::ash::FrameType::NAK: {
        uint8_t ack = static_cast<uint8_t>(frame.control & 0x07);
        ESP_LOGV(TAG, "prime NAK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        break;
      }
      case efr32::ash::FrameType::ERROR: {
        ESP_LOGW(TAG, "ASH error during prime 0x%02X",
                 frame.payload.empty() ? 0 : frame.payload[0]);
        break;
      }
      default:
        break;
    }
  }
  return host_rx_seq_ >= 4;
}

void EFR32InfoComponent::apply_rstack_from_payload_(const std::vector<uint8_t> &payload, bool loose) {
  if (payload.empty())
    return;
  uint8_t ash_ver = payload[0];
  uint8_t reset_code = payload.size() >= 2 ? payload[1] : 0xFF;
  saw_rstack_ = true;
  host_rx_seq_ = 0;
  ash_state_.next_ack = 0;
  have_last_delivered_ = false;
  last_delivered_seq_ = 0;
  bootstrap_seq_known_ = false;
  char buf[64];
  if (loose) {
    std::snprintf(buf, sizeof(buf), "ASHv%u reset=0x%02X (loose)", static_cast<unsigned>(ash_ver),
                  static_cast<unsigned>(reset_code));
  } else {
    std::snprintf(buf, sizeof(buf), "ASHv%u reset=0x%02X", static_cast<unsigned>(ash_ver),
                  static_cast<unsigned>(reset_code));
  }
  last_ezsp_version_ = buf;
  publish_text_(ezsp_version_sensor_, last_ezsp_version_);
  efr32::ash::send_ack(ash_state_, false, 0);
  ESP_LOGV(TAG, "RSTACK acked with seq=0%s", loose ? " (loose)" : "");
  if (raw_capture_) {
    ESP_LOGV(TAG, "RAW RX RSTACK ver=%u code=0x%02X (%s)", static_cast<unsigned>(ash_ver),
             static_cast<unsigned>(reset_code), loose ? "loose" : "direct");
  }
}

