tube0013/esphome-components/components/efr32_info/efr32_info.cpp
void EFR32InfoComponent::seed_initial_window_(uint8_t delivered_seq) {
  last_delivered_seq_ = delivered_seq;
  have_last_delivered_ = true;
  host_rx_seq_ = static_cast<uint8_t>((delivered_seq + 1) & 0x07);
  ash_state_.next_ack = host_rx_seq_;
  ash_state_.last_ack = host_rx_seq_;
  ash_state_.last_rx_seq = delivered_seq;
  bootstrap_seq_known_ = true;
  ESP_LOGI(TAG, "Seeded initial window seq=%u -> host_rx_seq_=%u", static_cast<unsigned>(delivered_seq),
           static_cast<unsigned>(host_rx_seq_));
}

bool try_loose_rstack_(esphome::uart::UARTComponent *uart, uint8_t &ash_ver, uint8_t &reset_code, uint32_t timeout_ms) {
  if (uart == nullptr)
    return false;
  uint32_t start = millis();
  std::vector<uint8_t> buf;
  buf.reserve(64);
  while (millis() - start < timeout_ms) {
    uint8_t b;
    if (uart->available() && uart->read_byte(&b)) {
      buf.push_back(b);
      if (buf.size() > 64)
        buf.erase(buf.begin(), buf.begin() + (buf.size() - 64));
      if (b == 0x7E) {
        if (buf.size() >= 5) {
          size_t end = buf.size() - 1;
          size_t limit = end >= 2 ? end - 2 : 0;
          for (size_t i = 0; i + 2 < limit; i++) {
            if (buf[i] == 0xC1) {
              ash_ver = buf[i + 1];
              reset_code = buf[i + 2];
              return true;
            }
          }
        }
      }
    } else {
      App.feed_wdt();
      esphome::delay(2);
    }
  }
  return false;
}

void EFR32InfoComponent::parse_unsolicited_ezsp_(const std::vector<uint8_t> &ezsp) {
  if (ezsp.size() < 5)
    return;

  const uint16_t frame_id = static_cast<uint16_t>(ezsp[3]) | (static_cast<uint16_t>(ezsp[4]) << 8);
  const uint8_t status = ezsp.size() > 5 ? ezsp[5] : 0xFF;

  switch (frame_id) {
    case 0x0002: {  // getVersion
      if (status != 0x00 || ezsp.size() < 11)
        break;
      uint8_t major = ezsp[6];
      uint8_t minor = ezsp[7];
      uint8_t patch = ezsp[8];
      uint8_t special = ezsp[9];
      uint32_t build = static_cast<uint32_t>(ezsp[10]);
      if (ezsp.size() >= 12)
        build |= static_cast<uint32_t>(ezsp[11]) << 8;
      char buf[64];
      std::snprintf(buf, sizeof(buf), "%u.%u.%u.%u build %u",
                    static_cast<unsigned>(major), static_cast<unsigned>(minor),
                    static_cast<unsigned>(patch), static_cast<unsigned>(special),
                    static_cast<unsigned>(build));
      last_stack_version_ = buf;
      publish_text_(stack_version_sensor_, last_stack_version_);
      char fw_only[32];
      std::snprintf(fw_only, sizeof(fw_only), "%u.%u.%u.%u",
                    static_cast<unsigned>(major), static_cast<unsigned>(minor),
                    static_cast<unsigned>(patch), static_cast<unsigned>(special));
      last_firmware_ = fw_only;
      publish_text_(firmware_sensor_, last_firmware_);
      break;
    }
    case 0x000B: {  // getMfgToken
      if (status != 0x00 || ezsp.size() < 7)
        break;
      uint8_t length = ezsp[6];
      size_t start = 7;
      if (ezsp.size() < start + length)
        length = static_cast<uint8_t>(ezsp.size() > start ? ezsp.size() - start : 0);
      if (length == 0)
        break;
      std::vector<uint8_t> data(ezsp.begin() + start, ezsp.begin() + start + length);
      std::string text = extract_ascii_(data);
      if (text.empty())
        break;
      if (last_manufacturer_.empty()) {
        last_manufacturer_ = text;
        publish_text_(manufacturer_sensor_, last_manufacturer_);
      } else if (last_board_name_.empty() && text != last_manufacturer_) {
        last_board_name_ = text;
        publish_text_(board_name_sensor_, last_board_name_);
      }
      break;
    }
    case 0x0026: {  // getEui64
      if (status != 0x00 || ezsp.size() < 14)
        break;
      std::vector<uint8_t> eui(ezsp.begin() + 6, ezsp.begin() + 14);
      char buf[24];
      std::snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
                    eui[7], eui[6], eui[5], eui[4], eui[3], eui[2], eui[1], eui[0]);
      last_ieee_ = buf;
      publish_text_(ieee_sensor_, last_ieee_);
      break;
    }
    case 0x0027: {  // getNodeId
      if (status != 0x00 || ezsp.size() < 8)
        break;
      uint16_t node = static_cast<uint16_t>(ezsp[6]) | (static_cast<uint16_t>(ezsp[7]) << 8);
      char buf[12];
      std::snprintf(buf, sizeof(buf), "0x%04X", static_cast<unsigned>(node));
      last_node_id_ = buf;
      publish_text_(node_id_sensor_, last_node_id_);
      break;
    }
    case 0x0018: {  // getNetworkParameters?
      if (status != 0x00 || ezsp.size() < 7)
        break;
      uint8_t state = ezsp[6];
      last_network_status_ = network_status_to_string(state);
      publish_text_(network_status_sensor_, last_network_status_);
      break;
    }
    case 0x0069: {  // getKeyTableEntry / security state (bitmask)
      if (status != 0x00 || ezsp.size() < 8)
        break;
      uint16_t bitmask = static_cast<uint16_t>(ezsp[6]) | (static_cast<uint16_t>(ezsp[7]) << 8);
      char buf[48];
      std::snprintf(buf, sizeof(buf), "mask=0x%04X", static_cast<unsigned>(bitmask));
      last_security_state_ = buf;
      publish_text_(security_state_sensor_, last_security_state_);
      break;
    }
    default:
      break;
  }
}

bool EFR32InfoComponent::parse_token_reply_(const std::vector<uint8_t> &resp, std::string &out) {
  if (resp.size() < 6)
    return false;

  size_t pos = 5;
  uint8_t status = 0x00;
  if (pos < resp.size() && (resp[pos] == 0x00 || resp[pos] == 0x0D)) {
    status = resp[pos++];
  }
  if (status != 0x00) {
    ESP_LOGW(TAG, "Token reply status=0x%02X resp=%s", static_cast<unsigned>(status),
             bytes_to_hex_(resp, 24).c_str());
    return false;
  }
  if (pos >= resp.size())
    return false;

  uint8_t length = resp[pos++];
  if (pos + length > resp.size())
    length = static_cast<uint8_t>(resp.size() - pos);
  if (length == 0)
    return false;

  std::vector<uint8_t> data(resp.begin() + pos, resp.begin() + pos + length);
  std::string text = extract_ascii_(data);
  if (text.empty())
    text = bytes_to_hex_(data, 32);
  out = text;
  return true;
}

bool EFR32InfoComponent::parse_v8_version_reply_(const std::vector<uint8_t> &resp) {
  if (resp.size() < 7) {
    ESP_LOGW(TAG, "VERSION(min) reply too short resp=%s", bytes_to_hex_(resp, 24).c_str());
    return false;
  }
  if (!(resp[1] == 0x80 && resp[2] == 0x01 && resp[3] == 0x00 && resp[4] == 0x00)) {
    ESP_LOGW(TAG, "Unexpected VERSION(min) header resp=%s", bytes_to_hex_(resp, 24).c_str());
  }

  size_t pos = 5;
  uint8_t protocol_version = resp[pos];

  if (resp.size() <= pos + 1) {
    ESP_LOGW(TAG, "VERSION(min) payload truncated resp=%s", bytes_to_hex_(resp, 24).c_str());
    return false;
  }

  uint8_t stack_type = resp[pos + 1];
  if (resp.size() <= pos + 3) {
    ESP_LOGW(TAG, "VERSION(min) missing stack version resp=%s", bytes_to_hex_(resp, 24).c_str());
    return false;
  }
  uint16_t stack_version = static_cast<uint16_t>(resp[pos + 2]) |
                           (static_cast<uint16_t>(resp[pos + 3]) << 8);
  unsigned A = (stack_version >> 12) & 0x0F;
  unsigned B = (stack_version >> 8) & 0x0F;
  unsigned C = (stack_version >> 4) & 0x0F;
  unsigned D = stack_version & 0x0F;
  char buf[80];
  std::snprintf(buf, sizeof(buf), "type=0x%02X ver=%u.%u.%u.%u (0x%04X)",
                static_cast<unsigned>(stack_type), A, B, C, D, static_cast<unsigned>(stack_version));
  last_stack_version_ = buf;
  publish_text_(stack_version_sensor_, last_stack_version_);
  char fw_buf[32];
  std::snprintf(fw_buf, sizeof(fw_buf), "%u.%u.%u.%u", A, B, C, D);
  last_firmware_ = fw_buf;
  publish_text_(firmware_sensor_, last_firmware_);
  ezsp_protocol_version_ = protocol_version;
  return true;
}

void EFR32InfoComponent::ack_re_sync_() {
  uint8_t expected = host_rx_seq_;
  if (have_last_delivered_) {
    expected = static_cast<uint8_t>((last_delivered_seq_ + 1) & 0x07);
  }
  host_rx_seq_ = expected;
  ash_state_.next_ack = expected;
  ash_state_.last_ack = expected;
  ash_state_.last_rx_seq = have_last_delivered_ ? last_delivered_seq_ : 7;
  bootstrap_seq_known_ = have_last_delivered_;
  ESP_LOGV(TAG, "ACK re-sync host_rx_seq_=%u have_last=%d",
           static_cast<unsigned>(host_rx_seq_), have_last_delivered_ ? 1 : 0);
}

bool EFR32InfoComponent::ack_data_frame_(uint8_t ctrl, const std::vector<uint8_t> &payload) {
  const bool retransmit = (ctrl & 0x08) != 0;
  const uint8_t ns = static_cast<uint8_t>((ctrl >> 4) & 0x07);
  const uint8_t frame_ack = static_cast<uint8_t>(ctrl & 0x07);
  const uint8_t expected = host_rx_seq_;
  (void) frame_ack;
  uint8_t ack_num = host_rx_seq_;
  bool accepted_new_payload = false;

  ESP_LOGV(TAG,
           "RX DATA ctrl=0x%02X ns=%u re=%u ack=%u expect=%u host_rx=%u len=%u",
           static_cast<unsigned>(ctrl), static_cast<unsigned>(ns), retransmit ? 1U : 0U,
           static_cast<unsigned>(frame_ack), static_cast<unsigned>(expected),
           static_cast<unsigned>(host_rx_seq_), static_cast<unsigned>(payload.size()));

  if (!link_bootstrapped_)
    link_bootstrapped_ = true;

  if (!payload.empty() && payload[0] == 0xC1) {
    apply_rstack_from_payload_(payload);
    host_rx_seq_ = 0;
    have_last_delivered_ = false;
    last_delivered_seq_ = 0;
    ash_state_.last_rx_seq = ns;
    ash_state_.next_ack = 0;
    ash_state_.last_ack = 0;
    efr32::ash::send_ack(ash_state_, false, 0);
    ESP_LOGV(TAG, "RSTACK via DATA frame ns=%u", static_cast<unsigned>(ns));
    return false;
  }

  uint8_t delta = static_cast<uint8_t>((ns - expected) & 0x07);
  ESP_LOGV(TAG,
           "FRAME ctrl=0x%02X ns=%u re=%u expected=%u delta=%u ack=%u host_rx=%u have_last=%d last=%u len=%zu",
           static_cast<unsigned>(ctrl), static_cast<unsigned>(ns), retransmit ? 1U : 0U,
           static_cast<unsigned>(expected), static_cast<unsigned>(delta),
           static_cast<unsigned>(frame_ack), static_cast<unsigned>(host_rx_seq_),
           have_last_delivered_ ? 1 : 0, static_cast<unsigned>(last_delivered_seq_), payload.size());

