tube0013/esphome-components/components/efr32_info/efr32_info.cpp
  uint8_t desired_tx_seq = frame_ack;
  if (ash_state_.tx_seq != desired_tx_seq) {
    ESP_LOGV(TAG, "Re-sync tx_seq from %u to %u based on ack", static_cast<unsigned>(ash_state_.tx_seq),
             static_cast<unsigned>(desired_tx_seq));
    ash_state_.tx_seq = desired_tx_seq;
  }

  if (retransmit) {
    if (payload.empty()) {
      ESP_LOGV(TAG, "Retransmit empty DATA ns=%u acking without advance",
               static_cast<unsigned>(ns));
    } else {
      ESP_LOGV(TAG, "Retransmit DATA seq=%u (ack=%u no advance)", static_cast<unsigned>(ns),
               static_cast<unsigned>(host_rx_seq_));
    }
    ack_num = host_rx_seq_;
  } else if (ns == expected) {
    host_rx_seq_ = static_cast<uint8_t>((host_rx_seq_ + 1) & 0x07);
    ack_num = host_rx_seq_;
    accepted_new_payload = true;
    bootstrap_seq_known_ = true;
    ESP_LOGV(TAG, "Accepting DATA seq=%u -> host_rx_seq_=%u", static_cast<unsigned>(ns),
             static_cast<unsigned>(host_rx_seq_));
  } else if (have_last_delivered_ && ns == last_delivered_seq_) {
    ESP_LOGV(TAG, "Duplicate DATA seq=%u (last=%u) acking", static_cast<unsigned>(ns),
             static_cast<unsigned>(last_delivered_seq_));
    ack_num = host_rx_seq_;
  } else {
    ESP_LOGW(TAG, "Out-of-sequence DATA frame ns=%u expected=%u delta=%u (NAK)",
             static_cast<unsigned>(ns), static_cast<unsigned>(expected),
             static_cast<unsigned>(delta));
    ash_state_.next_ack = expected;
    ash_state_.last_ack = expected;
    efr32::ash::send_nak(ash_state_, expected);
    if (raw_capture_) {
      ESP_LOGV(TAG, "RAW TX NAK ack=%u", static_cast<unsigned>(expected));
    }
    return false;
  }

  if (accepted_new_payload) {
    parse_unsolicited_ezsp_(payload);
    ash_state_.last_rx_seq = ns;
    last_delivered_seq_ = ns;
    have_last_delivered_ = true;
  }

  ash_state_.next_ack = host_rx_seq_;
  ash_state_.last_ack = ack_num;
  efr32::ash::send_ack(ash_state_, false, ack_num);

  if (raw_capture_) {
    ESP_LOGV(TAG, "RAW RX DATA ctrl=0x%02X ns=%u re=%u ack=%u len=%u data=%s",
             static_cast<unsigned>(ctrl), static_cast<unsigned>(ns), retransmit ? 1 : 0,
             static_cast<unsigned>(ack_num), static_cast<unsigned>(payload.size()),
             bytes_to_hex_(payload, 80).c_str());
    ESP_LOGV(TAG, "RAW TX ACK ack=%u", static_cast<unsigned>(ack_num));
  }

  ESP_LOGV(TAG, "ACK ctrl=0x%02X ns=%u re=%u ack=%u expected_before=%u",
           static_cast<unsigned>(ctrl), static_cast<unsigned>(ns), retransmit ? 1 : 0,
           static_cast<unsigned>(ack_num), static_cast<unsigned>(expected));

  ESP_LOGV(TAG, "FRAME handled accepted=%d host_rx_now=%u ack_sent=%u have_last=%d",
           accepted_new_payload ? 1 : 0, static_cast<unsigned>(host_rx_seq_),
           static_cast<unsigned>(ack_num), have_last_delivered_ ? 1 : 0);

  return accepted_new_payload;
}

void EFR32InfoComponent::send_rst_frame_() {
  const uint32_t start = millis();
  if (!saw_rstack_) {
    ash_state_.reset_counters();
    link_bootstrapped_ = false;
    ash_state_.next_ack = 0;
    host_rx_seq_ = 0;
    have_last_delivered_ = false;
    last_delivered_seq_ = 0;
    bootstrap_seq_known_ = false;
    efr32::ash::send_reset(uart_);
  } else {
    // Bellows sends CANCEL + RST + FLAG even when RSTACK already seen.
    auto *uart = uart_;
    if (uart != nullptr) {
      const uint8_t cancel = efr32::ash::CAN;
      const uint8_t rst_body[] = {0xC0, 0x38, 0xBC};
      uart->write_byte(cancel);
      uart->write_byte(efr32::ash::FLAG);
      efr32::ash::write_escaped(uart, rst_body, sizeof(rst_body));
      uart->write_byte(efr32::ash::FLAG);
    }
  }
  ESP_LOGD(TAG, "send_rst_frame duration=%u", static_cast<unsigned>(millis() - start));
}

void EFR32InfoComponent::send_data_frame_(const std::vector<uint8_t> &ezsp_payload, bool retransmit) {
  uint8_t ack = host_rx_seq_;
  ESP_LOGV(TAG, "TX DATA seq=%u ack=%u len=%u", static_cast<unsigned>(ash_state_.tx_seq),
           static_cast<unsigned>(ack), static_cast<unsigned>(ezsp_payload.size()));
  if (raw_capture_) {
    ESP_LOGV(TAG, "RAW TX DATA seq=%u ack=%u len=%u data=%s",
             static_cast<unsigned>(ash_state_.tx_seq), static_cast<unsigned>(ack),
             static_cast<unsigned>(ezsp_payload.size()), bytes_to_hex_(ezsp_payload, 80).c_str());
  }
  efr32::ash::send_data_frame(ash_state_, ezsp_payload, ack, retransmit);
  if (!retransmit) {
    last_tx_payload_ = ezsp_payload;
    last_tx_seq_ = static_cast<uint8_t>((ash_state_.tx_seq + 7) & 0x07);
    have_last_tx_ = true;
  }
}

void EFR32InfoComponent::send_v4_version_probe_(bool retransmit) {
  std::vector<uint8_t> payload{0x00, 0x00, 0x00, 0x04};
  ESP_LOGI(TAG, "%s legacy VERSION(min) probe", retransmit ? "Retransmitting" : "Sending");
  send_data_frame_(payload, retransmit);
}

void EFR32InfoComponent::retransmit_last_tx_(uint8_t ack_num) {
  if (!have_last_tx_) {
    ESP_LOGW(TAG, "No frame available for retransmission (ack=%u)", static_cast<unsigned>(ack_num));
    return;
  }
  uint8_t saved_seq = ash_state_.tx_seq;
  uint8_t saved_next_ack = ash_state_.next_ack;
  uint8_t saved_last_ack = ash_state_.last_ack;
  ash_state_.tx_seq = last_tx_seq_;
  ESP_LOGW(TAG, "Retransmitting seq=%u with ack=%u len=%zu", static_cast<unsigned>(last_tx_seq_),
           static_cast<unsigned>(ack_num), last_tx_payload_.size());
  if (raw_capture_) {
    ESP_LOGV(TAG, "RAW TX RETX seq=%u ack=%u len=%u data=%s", static_cast<unsigned>(last_tx_seq_),
             static_cast<unsigned>(ack_num), static_cast<unsigned>(last_tx_payload_.size()),
             bytes_to_hex_(last_tx_payload_, 80).c_str());
  }
  efr32::ash::send_data_frame(ash_state_, last_tx_payload_, ack_num, true);
  ash_state_.tx_seq = saved_seq;
  ash_state_.next_ack = saved_next_ack;
  ash_state_.last_ack = saved_last_ack;
}

bool EFR32InfoComponent::wait_for_v4_version_(uint32_t timeout_ms) {
  uint32_t deadline = millis() + timeout_ms;
  uint32_t last_progress = millis();
  uint8_t last_seen_seq = 0xFF;
  while (millis() < deadline) {
    efr32::ash::Frame frame;
    if (!recv_any_frame_(frame, 80)) {
      if (!efr32::ash::recv_frame_loose(ash_state_, frame, 120)) {
        if (millis() - last_progress > 250) {
          ESP_LOGV(TAG, "wait_v4 idle host_rx_seq_=%u next_ack=%u", static_cast<unsigned>(host_rx_seq_),
                   static_cast<unsigned>(ash_state_.next_ack & 0x07));
          last_progress = millis();
        }
        delay_(5);
        continue;
      }
      ESP_LOGV(TAG, "wait_v4 loose ctrl=0x%02X type=%d", static_cast<unsigned>(frame.control),
               static_cast<int>(frame.type));
    }

    switch (frame.type) {
      case efr32::ash::FrameType::DATA: {
        if (raw_capture_) {
          ESP_LOGV(TAG, "RAW RX V4 ctrl=0x%02X len=%u data=%s", static_cast<unsigned>(frame.control),
                   static_cast<unsigned>(frame.payload.size()), bytes_to_hex_(frame.payload, 80).c_str());
        }
        bool accepted = ack_data_frame_(frame.control, frame.payload);
        ESP_LOGV(TAG, "wait_v4 DATA ctrl=0x%02X accepted=%d host_rx_seq_=%u",
                 static_cast<unsigned>(frame.control), accepted ? 1 : 0,
                 static_cast<unsigned>(host_rx_seq_));
        uint8_t seq = static_cast<uint8_t>((frame.control >> 4) & 0x07);
        if (accepted) {
          last_progress = millis();
          last_seen_seq = seq;
        } else if (seq == last_seen_seq) {
          // duplicate burst following an accepted frame; keep waiting
          last_progress = millis();
        }
        if (!accepted)
          continue;

