tube0013/esphome-components/components/efr32_info/efr32_info.cpp
        const std::vector<uint8_t> &ezsp = frame.payload;
        std::string hex = bytes_to_hex_(ezsp, 32);
        ESP_LOGI(TAG, "Legacy VERSION(min) reply ezsp=%s", hex.c_str());
        last_ezsp_version_ = "v4 VERSION(min)";
        publish_text_(ezsp_version_sensor_, last_ezsp_version_);
        return true;
      }
      case efr32::ash::FrameType::ACK: {
        uint8_t ack = ctrl_ack(frame.control);
        ESP_LOGV(TAG, "wait_v4 ACK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        break;
      }
      case efr32::ash::FrameType::NAK: {
        uint8_t ack = ctrl_ack(frame.control);
        ESP_LOGW(TAG, "wait_v4 NAK ctrl=0x%02X ack=%u -- retrying", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        retransmit_last_tx_(ack);
        deadline = millis() + 1000;
        break;
      }
      case efr32::ash::FrameType::ERROR: {
        uint16_t code = 0;
        if (frame.payload.size() >= 2)
          code = static_cast<uint16_t>(frame.payload[0] << 8) | frame.payload[1];
        ESP_LOGE(TAG, "ASH error during v4 wait 0x%04X", static_cast<unsigned>(code));
        update_status_text_("ash-error");
        return false;
      }
      case efr32::ash::FrameType::RESET: {
        ESP_LOGW(TAG, "RESET during v4 wait; applying payload");
        apply_rstack_from_payload_(frame.payload, true);
        break;
      }
      default:
        break;
    }
  }

  ESP_LOGW(TAG, "Timeout waiting for v4 VERSION(min) host_rx_seq_=%u", static_cast<unsigned>(host_rx_seq_));
  return false;
}

bool EFR32InfoComponent::wait_for_rstack_(uint32_t timeout_ms, uint8_t &ash_version, uint8_t &reset_code) {
  uint32_t deadline = millis() + timeout_ms;
  while (millis() < deadline) {
    efr32::ash::Frame frame;
    if (!recv_any_frame_(frame, 80)) {
      if (!efr32::ash::recv_frame_loose(ash_state_, frame, 120)) {
        delay_(5);
        continue;
      }
      ESP_LOGV(TAG, "Loose frame ctrl=0x%02X type=%d while waiting for RSTACK",
               static_cast<unsigned>(frame.control), static_cast<int>(frame.type));
    }

    if (frame.type == efr32::ash::FrameType::RESET) {
      apply_rstack_from_payload_(frame.payload);
      update_status_text_("rstack");
      ESP_LOGI(TAG, "RSTACK received");
      if (raw_capture_) {
        ESP_LOGV(TAG, "RAW TX ACK ack=0 (RSTACK)");
      }
      efr32::ash::send_ack(ash_state_, false, 0);
      return true;
    }

    if (frame.type == efr32::ash::FrameType::DATA) {
      ESP_LOGW(TAG, "Data frame before RSTACK; assuming link already up");
      if (raw_capture_) {
        ESP_LOGV(TAG, "RAW RX ctrl=0x%02X len=%u data=%s", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(frame.payload.size()), bytes_to_hex_(frame.payload, 80).c_str());
      }
      if (ack_data_frame_(frame.control, frame.payload))
        return true;
      continue;
    }
    ESP_LOGV(TAG, "Ignored frame ctrl=0x%02X type=%d while waiting for RSTACK",
             static_cast<unsigned>(frame.control), static_cast<int>(frame.type));
  }
  if (try_loose_rstack_(uart_, ash_version, reset_code, 200)) {
    std::vector<uint8_t> payload;
    payload.push_back(ash_version);
    payload.push_back(reset_code);
    apply_rstack_from_payload_(payload, true);
    return true;
  }
  return false;
}

bool EFR32InfoComponent::wait_for_ezsp_(int expected_seq, uint16_t expected_frame_id, std::vector<uint8_t> &ezsp_out, uint32_t timeout_ms) {
  const bool want_specific = expected_seq >= 0;
  uint32_t deadline = millis() + timeout_ms;
  while (millis() < deadline) {
    efr32::ash::Frame frame;
    if (!recv_any_frame_(frame, 200)) {
      delay_(5);
      continue;
    }

    switch (frame.type) {
      case efr32::ash::FrameType::DATA: {
        if (raw_capture_) {
          ESP_LOGV(TAG, "RAW RX ctrl=0x%02X len=%u data=%s", static_cast<unsigned>(frame.control),
                   static_cast<unsigned>(frame.payload.size()), bytes_to_hex_(frame.payload, 80).c_str());
        }
        ESP_LOGV(TAG, "wait_ezsp DATA ctrl=0x%02X len=%zu", static_cast<unsigned>(frame.control),
                 frame.payload.size());
        if (!ack_data_frame_(frame.control, frame.payload))
          continue;
        const std::vector<uint8_t> &ezsp = frame.payload;
        if (ezsp.size() < 5) {
          continue;
        }
        uint8_t seq = ezsp[0];
        uint16_t frame_id = static_cast<uint16_t>(ezsp[3]) | (static_cast<uint16_t>(ezsp[4]) << 8);
        if (frame_id == 0x0058) {
          uint8_t status = ezsp.size() >= 6 ? ezsp[5] : 0xFF;
          ESP_LOGW(TAG, "EZSP invalidCommand seq=%u status=0x%02X (expected=0x%04X)",
                   static_cast<unsigned>(seq), static_cast<unsigned>(status),
                   static_cast<unsigned>(expected_frame_id));
          return false;
        }
        ESP_LOGV(TAG, "wait_ezsp got seq=%u frame_id=0x%04X len=%zu", static_cast<unsigned>(seq),
                 static_cast<unsigned>(frame_id), ezsp.size());

        if (want_specific && seq == expected_seq && frame_id == expected_frame_id) {
          ezsp_out = ezsp;
          return true;
        }

        if (want_specific) {
          ESP_LOGV(TAG, "wait_ezsp ignoring seq=%u frame_id=0x%04X want seq=%d frame_id=0x%04X",
                   static_cast<unsigned>(seq), static_cast<unsigned>(frame_id), expected_seq,
                   static_cast<unsigned>(expected_frame_id));
        }

        if (frame_id == 0x0026 && ezsp.size() >= 13) {
          std::vector<uint8_t> eui(ezsp.begin() + 5, ezsp.begin() + 13);
          char buf[24];
          std::snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
                        eui[7], eui[6], eui[5], eui[4], eui[3], eui[2], eui[1], eui[0]);
          last_ieee_ = buf;
          publish_text_(ieee_sensor_, last_ieee_);
        }

        break;
      }
      case efr32::ash::FrameType::ACK: {
        uint8_t ack = static_cast<uint8_t>(frame.control & 0x07);
        ESP_LOGV(TAG, "wait ACK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        break;
      }
      case efr32::ash::FrameType::NAK: {
        uint8_t ack = static_cast<uint8_t>(frame.control & 0x07);
        ESP_LOGW(TAG, "ASH NAK ctrl=0x%02X ack=%u", static_cast<unsigned>(frame.control),
                 static_cast<unsigned>(ack));
        retransmit_last_tx_(ack);
        break;
      }
      case efr32::ash::FrameType::ERROR: {
        uint16_t code = 0;
        if (frame.payload.size() >= 2)
          code = static_cast<uint16_t>(frame.payload[0] << 8) | frame.payload[1];
        ESP_LOGE(TAG, "ASH error frame 0x%04X", static_cast<unsigned>(code));
        update_status_text_("ash-error");
        return false;
      }
      case efr32::ash::FrameType::RESET: {
        uint8_t ash_ver = frame.payload.empty() ? 0 : frame.payload[0];
        uint8_t reset_code = frame.payload.size() >= 2 ? frame.payload[1] : 0xFF;
        char buf[48];
        std::snprintf(buf, sizeof(buf), "ASHv%u reset=0x%02X", static_cast<unsigned>(ash_ver), static_cast<unsigned>(reset_code));
        last_ezsp_version_ = buf;
        publish_text_(ezsp_version_sensor_, last_ezsp_version_);
        efr32::ash::send_ack(ash_state_, false, 0);
        break;
      }
      default:
        break;
    }
  }
  return false;
}

void EFR32InfoComponent::pump_frames_(uint32_t window_ms) {
  std::vector<uint8_t> scratch;
  wait_for_ezsp_(-1, 0, scratch, window_ms);
}

std::string EFR32InfoComponent::bytes_to_hex_(const std::vector<uint8_t> &data, size_t limit) {
  std::string out;
  size_t count = std::min(limit, data.size());
  out.reserve(count * 2 + 3);
  char tmp[3];
  for (size_t i = 0; i < count; i++) {
    std::snprintf(tmp, sizeof(tmp), "%02X", static_cast<unsigned>(data[i]));
    out.append(tmp);
  }
  if (data.size() > count)
    out.append("…");
  return out;
}

