tube0013/esphome-components/components/efr32_info/efr32_info.cpp
std::string EFR32InfoComponent::extract_ascii_(const std::vector<uint8_t> &data) {
  std::string trimmed = trim_token_ascii(data);
  if (!trimmed.empty())
    return trimmed;
  return find_printable_run(data);
}

void EFR32InfoComponent::run_probe_() {
  if (uart_ == nullptr) {
    ESP_LOGE(TAG, "UART not configured for efr32_info");
    update_status_text_("UART not configured");
    return;
  }

  struct GuardScope {
    EFR32InfoComponent *self;
    ~GuardScope() {
      if (self != nullptr)
        self->guard_active_ = false;
    }
  } guard_scope{this};
  guard_active_ = true;

  ash_state_.attach(uart_);
  link_bootstrapped_ = false;
  host_rx_seq_ = 0;
  have_last_delivered_ = false;
  last_delivered_seq_ = 0;
  bootstrap_seq_known_ = false;
  saw_rstack_ = false;
  ezsp_protocol_version_ = 0;
  ESP_LOGI(TAG, "Starting EZSP info probe");
  set_busy_(true);
  bool paused_stream = false;
  if (stream_server_ != nullptr) {
    stream_server_->pause();
    ESP_LOGI(TAG, "Stream server paused for probe");
    paused_stream = true;
    delay_(50);
  }

  update_status_text_("probing");

  uint32_t settle_deadline = millis() + 400;
  uint32_t quiet_since = millis();
  while (millis() < settle_deadline) {
    if (uart_->available()) {
      quiet_since = millis();
      flush_uart_();
    }
    if (millis() - quiet_since >= 200)
      break;
    delay_(5);
  }

  flush_uart_();

  ESP_LOGI(TAG, "ASH bootstrap attempt 1");
  send_rst_frame_();

  uint8_t ash_ver = 0;
  uint8_t reset_code = 0;
  if (!wait_for_rstack_(2000, ash_ver, reset_code)) {
    ESP_LOGE(TAG, "ASH link failed to synchronize (no RSTACK); aborting probe");
    update_status_text_("ash-sync-fail");
    if (paused_stream && stream_server_ != nullptr)
      stream_server_->resume();
    set_busy_(false);
    return;
  }

  ack_re_sync_();
  ash_state_.tx_seq = 0;
  send_v4_version_probe_();

  if (!wait_for_v4_version_(2500)) {
    ESP_LOGW(TAG, "v4 VERSION(min) not received; aborting probe");
    update_status_text_("v4-fail");
    if (paused_stream && stream_server_ != nullptr)
      stream_server_->resume();
    set_busy_(false);
    return;
  }
  ESP_LOGD(TAG, "v4 VERSION(min) handshake complete");

  auto build_ezsp = [](uint8_t seq, uint16_t frame_id, std::initializer_list<uint8_t> payload) {
    std::vector<uint8_t> frame;
    frame.reserve(5 + payload.size());
    frame.push_back(seq);
    frame.push_back(0x00);
    frame.push_back(0x01);
    frame.push_back(static_cast<uint8_t>(frame_id & 0xFF));
    frame.push_back(static_cast<uint8_t>((frame_id >> 8) & 0xFF));
    frame.insert(frame.end(), payload.begin(), payload.end());
    return frame;
  };

  auto send_and_expect = [&](uint8_t seq, uint16_t frame_id, std::initializer_list<uint8_t> payload, uint32_t timeout_ms, std::vector<uint8_t> &resp_out) -> bool {
    drain_frames_(120, -1);
    ack_re_sync_();
    drain_frames_(40, -1);
    auto payload_vec = build_ezsp(seq, frame_id, payload);
    send_data_frame_(payload_vec);
    return wait_for_ezsp_(seq, frame_id, resp_out, timeout_ms);
  };

  std::string status_summary;
  bool ok_version = false;
  bool tokens_ok = false;
  uint8_t ezsp_seq = 0;

  auto send_expect_seq = [&](uint16_t frame_id, std::initializer_list<uint8_t> payload, uint32_t timeout_ms,
                             std::vector<uint8_t> &resp_out) -> bool {
    uint8_t seq = ezsp_seq;
    ezsp_seq = static_cast<uint8_t>(ezsp_seq + 1);
    ESP_LOGD(TAG, "Probe sending EZSP 0x%04X seq=%u timeout=%u", static_cast<unsigned>(frame_id),
             static_cast<unsigned>(seq), static_cast<unsigned>(timeout_ms));
    bool ok = send_and_expect(seq, frame_id, payload, timeout_ms, resp_out);
    if (!ok) {
      ESP_LOGW(TAG, "EZSP command 0x%04X seq=%u failed", static_cast<unsigned>(frame_id),
               static_cast<unsigned>(seq));
    } else {
      ESP_LOGD(TAG, "Probe received EZSP 0x%04X seq=%u len=%zu", static_cast<unsigned>(frame_id),
               static_cast<unsigned>(seq), resp_out.size());
    }
    return ok;
  };

  const uint8_t requested_protocol = 0x0E;
  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0000, {requested_protocol}, 2500, resp)) {
      if (parse_v8_version_reply_(resp))
        ok_version = true;
      uint8_t negotiated = ezsp_protocol_version_;
      if (negotiated != 0 && negotiated != requested_protocol) {
        ESP_LOGI(TAG, "EZSP protocol negotiated version %u", static_cast<unsigned>(negotiated));
        std::vector<uint8_t> resp_confirm;
        if (send_expect_seq(0x0000, {negotiated}, 2000, resp_confirm)) {
          parse_v8_version_reply_(resp_confirm);
        }
      }
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0017, {0x00, 0x00}, 1500, resp)) {
      if (resp.size() >= 6) {
        uint8_t status = resp[5];
        char buf[32];
        std::snprintf(buf, sizeof(buf), "sl=0x%02X", static_cast<unsigned>(status));
        last_library_status_ = buf;
        publish_text_(library_status_sensor_, last_library_status_);
        ESP_LOGI(TAG, "networkInit status=0x%02X", static_cast<unsigned>(status));
      } else {
        last_library_status_ = "sl=?";
        publish_text_(library_status_sensor_, last_library_status_);
      }
    } else {
      ESP_LOGW(TAG, "networkInit command failed");
      last_library_status_ = "init-failed";
      publish_text_(library_status_sensor_, last_library_status_);
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0018, {}, 900, resp) && resp.size() >= 6) {
      uint8_t state = resp[5];
      last_network_status_ = network_status_to_string(state);
      publish_text_(network_status_sensor_, last_network_status_);
      ESP_LOGI(TAG, "Network state=0x%02X (%s)", static_cast<unsigned>(state),
               last_network_status_.c_str());
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0028, {}, 900, resp)) {
      if (resp.size() >= 26) {
        uint8_t status = resp[5];
        if (!(status == 0x00 || status == 0x17)) {
          ESP_LOGW(TAG, "Network parameters status=0x%02X resp=%s", static_cast<unsigned>(status),
                   bytes_to_hex_(resp, 48).c_str());
        }
        size_t pos = 7;  // start of EmberNetworkParameters
        std::vector<uint8_t> ext_pan(resp.begin() + pos, resp.begin() + pos + 8);
        pos += 8;
        uint16_t pan_id = static_cast<uint16_t>(resp[pos]) | (static_cast<uint16_t>(resp[pos + 1]) << 8);
        pos += 2;
        int8_t tx_power = static_cast<int8_t>(resp[pos++]);
        uint8_t radio_channel = resp[pos++];
        uint8_t join_method = resp[pos++];
        uint16_t manager_id = static_cast<uint16_t>(resp[pos]) | (static_cast<uint16_t>(resp[pos + 1]) << 8);
        pos += 2;
        uint8_t update_id = resp[pos++];
        uint32_t channel_mask = static_cast<uint32_t>(resp[pos]) |
                                (static_cast<uint32_t>(resp[pos + 1]) << 8) |
                                (static_cast<uint32_t>(resp[pos + 2]) << 16) |
                                (static_cast<uint32_t>(resp[pos + 3]) << 24);

        char chan_buf[16];
        std::snprintf(chan_buf, sizeof(chan_buf), "%u", static_cast<unsigned>(radio_channel));
        last_channel_ = chan_buf;
        publish_text_(channel_sensor_, last_channel_);
        ESP_LOGI(TAG, "Channel %u (txpwr=%d dBm update_id=%u mask=0x%08X)",
                 static_cast<unsigned>(radio_channel), static_cast<int>(tx_power),
                 static_cast<unsigned>(update_id), static_cast<unsigned>(channel_mask));

        char pan_buf[32];
        std::snprintf(pan_buf, sizeof(pan_buf), "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X/0x%04X",
                      ext_pan[7], ext_pan[6], ext_pan[5], ext_pan[4], ext_pan[3], ext_pan[2], ext_pan[1], ext_pan[0],
                      static_cast<unsigned>(pan_id));
        ESP_LOGI(TAG, "PAN %s manager=0x%04X join_method=0x%02X", pan_buf,
                 static_cast<unsigned>(manager_id), static_cast<unsigned>(join_method));

