tube0013/esphome-components/components/efr32_info/efr32_info.cpp
        if (status == 0x17) {
          last_network_status_ = "joined";
          publish_text_(network_status_sensor_, last_network_status_);
        }
      } else {
        ESP_LOGW(TAG, "Network parameters unexpected resp=%s", bytes_to_hex_(resp, 48).c_str());
      }
    }
  }

  {
    std::vector<uint8_t> resp;
    send_expect_seq(0x0147, {0x00, 0x03, 0x00, 0x00, 0x00}, 900, resp);
  }

  auto handle_token = [&](uint8_t token_id, std::string &target, esphome::text_sensor::TextSensor *sensor) -> bool {
    std::vector<uint8_t> resp;
    if (!send_expect_seq(0x000B, {token_id}, 1000, resp)) {
      ESP_LOGW(TAG, "Token 0x%02X request timed out", static_cast<unsigned>(token_id));
      return false;
    }
    if (!parse_token_reply_(resp, target)) {
      ESP_LOGW(TAG, "Token 0x%02X parse failed resp=%s", static_cast<unsigned>(token_id),
               bytes_to_hex_(resp, 48).c_str());
      return false;
    }
    publish_text_(sensor, target);
    ESP_LOGI(TAG, "Token 0x%02X value '%s'", static_cast<unsigned>(token_id), target.c_str());
    return true;
  };

  if (handle_token(0x01, last_manufacturer_, manufacturer_sensor_))
    tokens_ok = true;
  if (handle_token(0x02, last_board_name_, board_name_sensor_))
    tokens_ok = true;

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0026, {}, 800, resp)) {
      size_t start = 0;
      if (resp.size() >= 14 && resp[5] == 0x00) {
        start = 6;
      } else if (resp.size() >= 13) {
        start = resp.size() - 8;
      } else {
        ESP_LOGW(TAG, "IEEE reply too short len=%zu", resp.size());
        start = 0;
      }
      if (start + 8 <= resp.size()) {
        std::vector<uint8_t> eui(resp.begin() + start, resp.begin() + start + 8);
      char buf[24];
      std::snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
                    eui[7], eui[6], eui[5], eui[4], eui[3], eui[2], eui[1], eui[0]);
      last_ieee_ = buf;
      publish_text_(ieee_sensor_, last_ieee_);
      ESP_LOGI(TAG, "IEEE address %s", last_ieee_.c_str());
      } else {
        ESP_LOGW(TAG, "IEEE parse failed len=%zu start=%zu", resp.size(), start);
      }
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0002, {0x40}, 800, resp) && resp.size() >= 11 && resp[5] == 0x00) {
      uint8_t major = resp[6];
      uint8_t minor = resp[7];
      uint8_t patch = resp[8];
      uint8_t special = resp[9];
      uint32_t build = static_cast<uint32_t>(resp[10]);
      if (resp.size() >= 12)
        build |= static_cast<uint32_t>(resp[11]) << 8;
      char buf[64];
    std::snprintf(buf, sizeof(buf), "%u.%u.%u.%u build %u",
                  static_cast<unsigned>(major), static_cast<unsigned>(minor),
                  static_cast<unsigned>(patch), static_cast<unsigned>(special),
                  static_cast<unsigned>(build));
    last_stack_version_ = buf;
    publish_text_(stack_version_sensor_, last_stack_version_);
    char fw_only[32];
    std::snprintf(fw_only, sizeof(fw_only), "%u.%u.%u.%u",
                  static_cast<unsigned>(major), static_cast<unsigned>(minor),
                  static_cast<unsigned>(patch), static_cast<unsigned>(special));
    last_firmware_ = fw_only;
    publish_text_(firmware_sensor_, last_firmware_);
      ok_version = true;
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0027, {}, 800, resp)) {
      uint16_t node = 0xFFFF;
      bool parsed = false;
      if (resp.size() >= 8 && resp[5] == 0x00) {
        node = static_cast<uint16_t>(resp[6]) | (static_cast<uint16_t>(resp[7]) << 8);
        parsed = true;
      } else if (resp.size() >= 7) {
        node = static_cast<uint16_t>(resp[resp.size() - 2]) |
               (static_cast<uint16_t>(resp[resp.size() - 1]) << 8);
        parsed = true;
      }
      if (parsed) {
        char buf[12];
        std::snprintf(buf, sizeof(buf), "0x%04X", static_cast<unsigned>(node));
        last_node_id_ = buf;
        publish_text_(node_id_sensor_, last_node_id_);
        ESP_LOGI(TAG, "Node ID %s", last_node_id_.c_str());
      } else {
        ESP_LOGW(TAG, "Node ID parse failed len=%zu", resp.size());
      }
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0018, {}, 800, resp) && resp.size() >= 6) {
      uint8_t status = resp[5];
      uint8_t state = resp.size() >= 7 ? resp[6] : 0xFF;
      if (status == 0x00 || status == 0x17) {
        last_network_status_ = network_status_to_string(state);
        publish_text_(network_status_sensor_, last_network_status_);
      }
    }
  }

  {
    std::vector<uint8_t> resp;
    if (send_expect_seq(0x0069, {}, 900, resp)) {
      if (resp.size() >= 8) {
        uint8_t status = resp[5];
        if (status == 0x00 || status == 0x17) {
          uint16_t bitmask = static_cast<uint16_t>(resp[6]) | (static_cast<uint16_t>(resp[7]) << 8);
          char buf[48];
          std::snprintf(buf, sizeof(buf), "mask=0x%04X", static_cast<unsigned>(bitmask));
          last_security_state_ = buf;
          publish_text_(security_state_sensor_, last_security_state_);
          ESP_LOGI(TAG, "Security bitmask=0x%04X", static_cast<unsigned>(bitmask));
        } else {
          std::string hex = bytes_to_hex_(resp, 32);
          last_security_state_ = "raw=" + hex;
          publish_text_(security_state_sensor_, last_security_state_);
          ESP_LOGW(TAG, "Security state status=0x%02X resp=%s", static_cast<unsigned>(status), hex.c_str());
        }
      }
    }
  }

  if (tokens_ok) {
    status_summary = "ok";
  } else if (ok_version) {
    status_summary = "version-only";
  } else if (saw_rstack_) {
    status_summary = "partial";
  } else {
    status_summary = "no-response";
  }
  update_status_text_(status_summary);

  if (paused_stream && stream_server_ != nullptr) {
    stream_server_->resume();
    ESP_LOGI(TAG, "Stream server resumed after probe");
  }
  set_busy_(false);
  ESP_LOGI(TAG, "EZSP info probe complete (version=%s tokens=%s)", ok_version ? "ok" : "partial",
           tokens_ok ? "ok" : "missing");
}

}  // namespace efr32_info
}  // namespace esphome
